public class TODO_shopping {}
/*todo ========================================делали на прошлой паре abstract========================================
   1) продукт(категорию) превращаем в абстракт
   2) инкримитируем автоматическое айди вручную не делаем, прописываем новый вспомогательный метод на +1 модификатор доступа приват он закрыт айди поле +1 только в своём
    классе какой же этот метод абстрактный или нетгуглить автогенерация автоприсваивание в кострукторе без вставки автозополнения без поля в джаве
   3) создать консретный класс електронику категорию наследний от продукт(категория)
   4) садовые товары класс айди титле прайс описание дискриптион нужен список для электроники хэшМэп ключ категория (ключём указали продук категория, интерфейс лист
    {електроникка} сам себя запутал) новый хешМэп катеория ключ не повторяется
   5) создание объектов и добавить их в список*/

/*TODO ================================================ наследование ================================================
   1 ---
   2 ---
   3 ---
   4 ID поле внутри абстрактного класса privat инкапсюляция создать вспомогательный метод прибавление на +1 берёт айди прибавляет 1 и возвращает он приватный
    если он помогает он приват инкриминт айди авто присваивание значение в поле, метод не абстрактный
   5 создаём новые наследники каталога\продукта
   6 создаём из каждого наследника 3 объекта*/
/*TODO ============ customer =========
   добавить клиент-кастом класс
   пейбал помогает с товарами
   финансбл помогает клиенту
   надо ли добавить абстарактный класс
   новые объекты из кастома
   у клиента должно быть поле, взаимодействие с покупкой товарами
   инкапсюляция расширение класса
*/